#include<iostream>
using namespace std;
void main()
{
	char s1[10] = { 'H','e','l','l','o','!' };
	char s2[10] = { 'H','e','l','l','o','!','\0' };
	char s3[10] = { 'H','e','l','l','o',',',' ','m','o','m' };
	char s4[] = { 'H','e','l','l','o',',',' ','m','o','m' };
	//стрічки s3 і s4 не завершуються нуль-термінатором
	char s5[] = { 'H','e','l','l','o',',',' ','w','o','r','l','d','!','\0' };
	//стрічка s5 має в переліку значень символ завершення рядка
	cout << s1 << "\n" << s2 << "\n" << s3 << "\n" << s4
		<< '\n' << s5 << "\n";
	//при виведенні s3 виводиться також s2
	//при виведенні s4 виводиться також s3 i s2
}