// Ввести інформацію з файлу та записати її у масив.
#include<stdio.h>
#pragma warning(disable:4996)
int size_file(FILE*, const char*); //встановлення кількості елементів у файлі
int show_file(FILE*, const char*); // друк вмістимого файлу на екран
int from_file_to_array(FILE*, const char*, int*&, int&); //запис даних з файлу у масив
void show_array(int *, int, const char*); //друк елементів масиву на екран
int main()
{
	FILE * fil_in = 0; //оголошення файлової змінної
	const char * fname_in = "fil_rez.txt"; //стрічка з іменем файлу 
	//опрацьовуємо файл створений програмою з попереднього прикладу
	//копіюємо цей файл у папку проекту
	if (!show_file(fil_in, fname_in)) 
	// якщо друк вмістимого файлу на екран НЕ відбувся
	{
		printf("\n File %s no show\nend\n", fname_in);
		return 1;
	}
	int *a = 0, n = 0; //a -- ім'я масиву, n --розмірність масиву
	if (!from_file_to_array(fil_in, fname_in, a, n))
	//якщо запис даних з файлу у масив НЕ відбувся
	{
		printf("\nNo copy to file\nend\n");
		return 1;
	}
	if (n) //якщо масив непорожній
	{
		show_array(a, n, " From array"); //друк елементів масиву на екран
		delete[] a; //звільнення пам'яті
	}
	return 0;
}
int size_file(FILE*f, const char*fn) //встановлення кількості елементів у файлі
{
	if ((f = fopen(fn, "r")) == NULL) //якщо файл не вдалося відкрити для читання
	{
		printf("\n File %s not found\n", fn);//друк повідомлення
		return 0; //повернення значення "невдача"
	}
	int n = 0, a; // n -- кількість елементів у файлі
	//a --цілочисельна змінна для зберігання потосного даного, зчитаного з файлу
	fscanf(f, "%d", &a); //введення даного з файлу
	while (!feof(f)) //поки не досягнуто кінця файлу
	{ 
		n++; 
		fscanf(f, "%d", &a); //введення наступного даного з файлу
	}
	fclose(f); //закриття файлу
	return n ? n : -1; 
	//повернення кількості елементів у файлі або -1, якщо файл порожній
}
int show_file(FILE*f, const char*fn) //друк вмістимого файлу на екран
{
	if ((f = fopen(fn, "r")) == NULL) //якщо файл не вдалося відкрити для читання
	{
		printf("\n File %s not found\n", fn); //друк повідомлення
		return 0; //повернення значення "невдача"
	}
	int a; //цілочисельна змінна для зберігання потосного даного, зчитаного з файлу
	puts(fn); //друк на екран імені файлу
	fscanf(f, "%d", &a); //введення даного з файлу
	while (!feof(f)) //поки не досягнуто кінця файлу
	{
		printf("%5d", a); //друк даного на екрані
		fscanf(f, "%d", &a); //введення наступного даного з файлу
	}
	puts("\n");
	fclose(f); //закриття файлу
	return 1; //повернення значення "успіх"
}
int from_file_to_array(FILE*f, const char*fn, int*&a, int&n) //запис даних з файлу у масив
{
	if ((f = fopen(fn, "rb")) == NULL) //якщо файл не вдалося відкрити для читання
	{
		printf("\n File %s not found\n", fn);//друк повідомлення
		return 0; //повернення значення "невдача"
	}
	n = size_file(f, fn); //встановлення кількості елементів у файлі
	if (n <= 0) //якщо n -- некоректне
	{
		printf("\nFile %s is empty\n"); // друк повідомлення
		return 0; //повернення значення "невдача"
	}
	a = new int[n]; //виділення пам'яті під динамічний масив
	for (int i = 0; i < n; i++)
		fscanf(f, "%d", a + i); //введення усіх даних з файлу у масив
	fclose(f); //закриття файлу
	return 1; //повернення значення "успіх"
}
void show_array(int *a, int n, const char*ms) //друк елементів масиву на екран
{
	puts(ms); //друк повідомлення
	for (int i = 0; i < n;  i++)
		printf("%5d", *a++); //поелементний друк масиву
	puts(""); //перевід на новий рядок
}