#include<iostream>
using namespace std;
void main()
{
	char s1[10] = { 'H','e','l','l','o','!' };
	char s2[10] = { 'H','e','l','l','o','!','\0'};
	char s3[10] = { 'H','e','l','l','o',',',' ','m','o','m' };//так НЕ можна
	//10 комірок для s3 не вміщає нуль-термінатор
	cout << s1 << "\n" << s2 << "\n" << s3 << "\n";
	//відсутність нуль-термінатора у s3 викликає виведення всього, 
	//що є в пам'яті до першого символа '\0' у стрічці s2
	//char s4[9] = { 'H','e','l','l','o',',',' ','m','o','m' };//помилка компіляції
	//кількість символів при ініціалізації s4 є більшою, ніж заданий розмір
}