//Створити структуру дріб.У масиві нескоротних дробів(таких, що їх
//    чисельник та знаменник не має спільних множників) знайти координати
//    тих, чисельники яких є непарними числами.Якщо такі відсутні, то
//    вивести відповідне повідомлення.Розбити проект на декілька файлів.

//main.cpp -- головна програма

#include"decl_file.h"

int main()
{
    /* зміна кодування для використання кирилиці при вводі та виводі */
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    int n; /* n - кількість дробів */
    cout << "\nВведіть бажану кількість дробів = ";
    n = EnterNumber();
    /* перевірка коректності вхідних даних */
    if (n <= 0)
        n = 2;
    Fraction* group = new Fraction[n]; /* виділення пам’яті під масив дробів */
    EnterArrayFraction(group, n); /* введення масиву дробів */
    PrintArrayFraction(group, n); /* друк масиву дробів */
    SearchArrayFraction(group, n);
    delete[]group; /* звільнення пам'яті */
    cout << "\nКIНЕЦЬ\n";
    return 0;
}