//Реалізувати алгоритм роботи банкомату, який за введеною сумою S,
//намагається видати її мінімальною кількістю купюр номіналами 100, 200 та 500 грн.
// (додати обмеження на кількість купюр певного номіналу).
#include<iostream>
using namespace std;
int main()
{
	int m1, m2, m3;
	m1 = 10;
	m2 = 3;
	m3 = 5;
	// m1- максимальна кількість 500
	// m2- максимальна кількість 200
	// m3- максимальна кількість 100
	int S, k1 = 0, k2 = 0, k3 = 0;
	do
	{
		cout << "Vvedit sumu S = "; cin >> S;
	} while (S <= 0 || S % 100 != 0);
	k1 = S / 500;
	if (k1 != 0)
	{
		S = S - 500 * k1;
	}
	k2 = S / 200;
	if (k2 != 0)
	{
		S = S - 200 * k2;
	}
	k3 = S / 100;
	if (k3 != 0)
	{
		S = S - 100 * k3;
	}
	if (k1 > m1 || k2 > m2 || k3 > m3)
		{
			cout << "nemae kypyr" << endl;
		}
	else
		{
			cout << "\nS = 500 x " << k1 << " + 200 x " << k2 << " + 100 x " << k3;
		}
	return 0;
}
