#include<iostream>      // бібліотека і відповідний заголовний файл
#include <Windows.h>    // підключення заголовного файлу
#include<math.h>        // математична бібліотека
using namespace std;    // директива для всіх ідентифікаторів в просторі імен

long long int factorial(int n)
{       
    long long int a = 1;
    for (int i = n; i > 0; i--) 
    {
        a *= i;
    }
    return a;
}
// а - змінна для обчислення факторіалів
// цикл для обчислення факторіалів

int main()
{
    SetConsoleOutputCP(1251); // встановлення кодування Windows-1251 для виведення даних
  
    double S=1;
    int i=0, n;
    //S - алгебраїчна сума (сума ряду)
    //n - верхня межа сумування, (n >= i)
    //i - індекс сумування, за умовою і=0 (0 - нижня межа сумування)

    cout << "\nі - індекс сумування, за умовою і=0";
    cout << "\nn - верхня межа сумування (n >= i)" ;
    cout << "\n......................................";
  
    do
    {
        cout << "\nВведіть значення n";
        cout << "\nn = "; cin >> n;
    } while (n < i);

   //Ввід даних користувачем

        for ( i = 1; i <= n; i++)
    {
            S = S + (factorial(n) / (factorial(i) * factorial(n - i))); 
       
    }
    //Знаходження алгебраїчної суми
        cout << "......................................" << endl;
        cout << "Алгебраїчна сума виразу:" << endl;
        cout << "S=" << S << endl;
    //Вивід результату на екран
    return 0;
}
